In [1]:
# How to print using python
print("I am a boy")

I am a boy

### NOTES
1. Variables

In [2]:
age = 5
print(age)

5

In [3]:
age = 5
age

5

In [4]:
blocks = 10
print(type(blocks))

<class 'int'>

In [5]:
print(blocks + 2)

12

In [6]:
# Examples of float
juice = 2.5
print(type(juice))

<class 'float'>

In [7]:
print(juice * 2)

5.0

In [8]:
# Examples of strings
name = "Luna the Cat"
print(type(name))

<class 'str'>

In [9]:
print("Hi,", name)

Hi, Luna the Cat

In [10]:
# Examples of Variables
is_hungry = False
print(type(is_hungry))

<class 'bool'>

In [11]:
print("Snack time?" if is_hungry else "Play more!")

Play more!

In [12]:
apples = 4
oranges = 3
total_fruit = apples + oranges
print(total_fruit)

7

In [13]:
half_apples = apples / 2
print(half_apples)

2.0

In [14]:
half_apples = apples / 2
half_apples

2.0

In [15]:
print(2 ** 3)

8

In [16]:
print(2 * 3)

6

In [17]:
print(8 - 2)

6

In [18]:
print(2 + 2)

4

In [19]:
a = 14 / 2
a

7.0

In [20]:
a = 14 // 2
a

7

In [21]:
a = 14 / 3
a

4.666666666666667

In [22]:
a = 14 // 3
a

4

In [23]:
a = 14 % 3
a

2

In [24]:
Modupe = 5
print(Modupe)

5

In [25]:
name = "Abdul"
print("Hi,", name, "! You are awesome.")

Hi, Abdul ! You are awesome.

In [26]:
name = input("What's your name? ")
print("Hi,", name, "! You are awesome.")

Hi, Chidex ! You are awesome.

In [27]:
mood = input("Tell me your mood? ").upper()
if mood == "HAPPY":
    print("Yay! Dance party! ðŸŽ‰")
elif mood == "sad":
    print("Hug time! ðŸ¤—")
else:
    print("Tell me more!")

Yay! Dance party! ðŸŽ‰

In [28]:
mood = input("Tell me your mood? ").lower() # Makes lowercase
if mood == "happy":
    print("Yay! Dance party! ðŸŽ‰")
elif mood == "sad":
    print("Hug time! ðŸ¤—")
else:
    print("Tell me more!")

Tell me more!

# Assignment Corrections

### Exercise 1

In [29]:
age = 30 # integer
print(age)
print(type(age))

30
<class 'int'>

In [30]:
print("Chidex")

Chidex

In [31]:
name = "Chidex"
print(name)

Chidex

In [32]:
name = "Chidex" # string
print("Hi,", name)

Hi, Chidex

In [33]:
is_sunny = True
print(is_sunny)

True

In [34]:
height_feet = 5.9 # float
height_inches = height_feet * 12
print(height_inches)

70.80000000000001

## Exercise 2

In [35]:
apples = 6
oranges = 4
total = apples + oranges
average = total / 2 # simple average
leftovers = total % 5 # remainder when divided by 5
print("Total:", total)
print("Average:", average)
print("Leftovers if shared by 5:", leftovers)

Total: 10
Average: 5.0
Leftovers if shared by 5: 0

In [36]:
greeting = "Hello"
full_greeting = greeting + ", world!"
print(full_greeting)
fun_repeat = "Fun! " * 3
print(fun_repeat)

Hello, world!
Fun! Fun! Fun!

In [37]:
name = input("What's your name? ")
print("Nice to meet you,", name + "!")
age = int(input("How old are you? "))
print("Next year I will be", age + 1)

Nice to meet you, !

ValueError: invalid literal for int() with base 10: ''

In [ ]:
number = int(input("Enter a number: "))
if number > 10:
    print("Big!")
elif number > 5 :
    print("Medium!")
else:
    print("Small!")

Small!

In [ ]:
number = int(input("Enter a number: "))
if number >= 10:
    print("ten and above")
elif number > 5 or number < 9:
    print("Happy")
else:
    print("Unhappy")

Happy

In [ ]:
number = int(input("Enter a number: "))
if number >= 10:
    print("ten and above")
elif number > 5 and number < 9:
    print("Happy")
else:
    print("Unhappy")

Happy

### List

In [ ]:
fruits = ["apple", "banana", "cherry"]
print(fruits)

['apple', 'banana', 'cherry']

In [ ]:
fruits[2]

'cherry'

In [ ]:
fruits.append("grape")
print(fruits)

['apple', 'banana', 'cherry', 'grape']

In [ ]:
fruits.pop(2)
print(fruits)

['banana', 'cherry']

In [ ]:
len(fruits)

2

In [ ]:
fruits = ["apple", "banana", "cherry"]
print(fruits)

['apple', 'banana', 'cherry']

In [ ]:
fruits.append("grape")
print(fruits)

['apple', 'banana', 'cherry', 'grape']

In [ ]:
fruits.pop(2)
print(fruits)

['apple', 'banana', 'grape']

In [ ]:
fruits.pop(0)
print(fruits)

['banana', 'grape']

In [ ]:
fruits.append("mango", "pear", "pineapple")
print(fruits)

['banana', 'grape', 'pear']

In [ ]:
fruits.extend(["mango", "pear", "pineapple"])
print(fruits)

['banana', 'grape', 'pear', 'mango', 'pear', 'pineapple']

In [ ]:
fruits.insert(3, "watermelon")
print(fruits)

['banana', 'grape', 'pear', 'watermelon', 'mango', 'pear', 'pineapple']

In [ ]:
fruits = ['banana', 'grape', 'pear', 'watermelon', 'mango', 'pineapple']
idxs = [5, 4, 2]
popped = [fruits.pop(i) for i in (idxs)]
print(popped)

['pineapple', 'mango', 'pear']

In [ ]:
fruits = ['banana', 'grape', 'pear', 'watermelon', 'mango', 'pineapple']
idxs = [5, 4, 2]
popped = [fruits.pop(i) for i in sorted(idxs, reverse=True)]
print(popped)

['pineapple', 'mango', 'pear']

In [ ]:
print(fruits)

['banana', 'grape', 'watermelon', 'pear']

In [ ]:
fruits = ['banana', 'grape', 'pear', 'watermelon', 'mango', 'pear', 'pineapple']
popped = fruits[2:5]
print(popped)
print(fruits)

['pear', 'watermelon', 'mango']
['banana', 'grape', 'pear', 'watermelon', 'mango', 'pear', 'pineapple']

In [ ]:
fruits = ['banana', 'grape', 'pear', 'watermelon', 'mango', 'pear', 'pineapple']
popped = fruits[2:5]
del fruits[2:5]
print(popped)
print(fruits)

['pear', 'watermelon', 'mango']
['banana', 'grape', 'pear', 'pineapple']

In [ ]:
fruits = ['banana', 'grape', 'pear', 'watermelon', 'mango', 'pear', 'pineapple']
for name in ("mango", "pear", "pineapple"):
    while name in fruits:
        fruits.remove(name)
print(fruits)

['banana', 'grape', 'watermelon']

In [ ]:
toys = ["ball", 5, True]

In [ ]:
for fruit in fruits:
    print(fruit)

banana
grape
watermelon

### Tuple

In [ ]:
skewers = ("apple", "banana", "cherry")
print(skewers)

('apple', 'banana', 'cherry')

In [ ]:
skewers[0]

'apple'

In [ ]:
skewers[1] = "orange"

TypeError: 'tuple' object does not support item assignment

In [ ]:
len(skewers)

3

In [ ]:
toys = ("ball", 5, True)
print(toys)

('ball', 5, True)

### Dictionaries

In [ ]:
fruit_map = {"apple": "red", "banana": "yellow", "cherry": "sweet"}
print(fruit_map)

{'apple': 'red', 'banana': 'yellow', 'cherry': 'sweet'}

In [ ]:
fruit_map["apple"]

'red'

In [ ]:
fruit_map["grape"] = "purple"
print(fruit_map)

{'apple': 'red', 'banana': 'yellow', 'cherry': 'sweet', 'grape': 'purple'}

In [ ]:
del fruit_map["cherry"]
print(fruit_map)

{'apple': 'red', 'banana': 'yellow', 'grape': 'purple'}

In [ ]:
fruit_map.keys()

dict_keys(['apple', 'banana', 'grape'])

In [ ]:
# List
fruits = ["apple", "banana"]
fruits.append("cherry")
print(fruits)

# Tuple
coords = (3, 4) # can't change
print(coords[0])

# Dictionary
toys = {"ball": "bouncy", "doll": "huggable"}
print(toys["ball"])

['apple', 'banana', 'cherry']
3
bouncy

# For Loop

In [ ]:
for i in range(5):
    print("Count:", i + 1)

Count: 1
Count: 2
Count: 3
Count: 4
Count: 5

In [ ]:
colors = ["red", "blue", "green"]
for color in colors:
    print("I like", color + "!")

I like red!
I like blue!
I like green!

# While Loop

In [ ]:
cookies = 3
while cookies > 0: # While True (cookies left)
    print("Nom nom! One cookie gone.")
    cookies = cookies - 1
print("All gone!")

Nom nom! One cookie gone.
Nom nom! One cookie gone.
Nom nom! One cookie gone.
All gone!

In [ ]:
guesses += 1 # Add 1

guesses = guesses + 1

In [ ]:
guesses = 0
secret_number = 7
guess_limit_number = 3
while guesses < guess_limit_number:
    #print("Guess my number! Hint: 7")
    guess = int(input())
    if guess == secret_number:
        print("Yes!")
        break
    guesses += 1 # Add 1
else:
    print("Too many tries!")

Yes!

# Functions

In [ ]:
def cookie_maker(num):
    cookies = "ðŸª " * num # Multiply num
    return cookies # Gift back the batch

batch = cookie_maker(3)
print(batch)

ðŸª ðŸª ðŸª

In [ ]:
def cookie_maker():
    cookies = "ðŸª " * 5 # Multiply num
    return cookies # Gift back the batch

batch = cookie_maker()
print(batch)

ðŸª ðŸª ðŸª ðŸª ðŸª

In [ ]:
def cookie_maker(num):
    cookies = "ðŸª " * 7 # Multiply num
    return cookies # Gift back the batch

batch = cookie_maker(7)
print(batch)

ðŸª ðŸª ðŸª ðŸª ðŸª ðŸª ðŸª

In [ ]:
def cookie_maker(num):
    cookies = "ðŸª " * num # Multiply num
    return cookies # Gift back the batch

batch = cookie_maker(10)
print(batch)

ðŸª ðŸª ðŸª ðŸª ðŸª ðŸª ðŸª ðŸª ðŸª ðŸª

# Error Handling

In [ ]:
a = 10 / 0
print(a)

ZeroDivisionError: division by zero

In [ ]:
def safe_divide(a, b):
    try:
        result = a / b
    except ZeroDivisionError: # specific error
        print("Oops! Can't divide by zero - try again!")
        result = "Error"
    else:
        print("Yay, it worked!")
    finally:
        print("Math time over -  back to play!")
    return result

print(safe_divide(10, 2)) # 5.0 - Yay!
# print(safe_divide(10, 0))

Yay, it worked!
Math time over -  back to play!
5.0

In [ ]:
def safe_divide(a, b):
    try:
        result = a / b
    except ZeroDivisionError: # specific error
        print("Oops! Can't divide by zero - try again!")
        result = "Error"
    else:
        print("Yay, it worked!")
    finally:
        print("Math time over -  back to play!")
    return result

# print(safe_divide(10, 2)) # 5.0 - Yay!
print(safe_divide(10, 0))

Oops! Can't divide by zero - try again!
Math time over -  back to play!
Error

In [ ]:
def safe_divide(a, b):
    try:
        result = a / b
    except Exception as e:
        print("Oops! Can't divide by zero - try again!")
        result = "Error"
    else:
        print("Yay, it worked!")
    finally:
        print("Math time over -  back to play!")
    return result

# print(safe_divide(10, 2)) # 5.0 - Yay!
print(safe_divide(10, 0))

Oops! Can't divide by zero - try again!
Math time over -  back to play!
Error

# Pandas

In [38]:
import pandas as pd # importing the pandas library

In [39]:
pd.__version__ # checking of pandas version

'2.1.4'

In [40]:
prices = pd.Series([10, 20, 15], index = ['ball','doll', 'car']) # creating a pandas series
print(prices)

ball    10
doll    20
car     15
dtype: int64

In [41]:
# Creating a pandas data frame
import pandas as pd
df = pd.DataFrame({
    'Toy': ['ball', 'doll', 'car', 'block'],
    'Price': [10, 20, 15, 5],
    'Stock': [50, 30, 40, 100]
})
print(df)

     Toy  Price  Stock
0   ball     10     50
1   doll     20     30
2    car     15     40
3  block      5    100

In [42]:
df

     Toy  Price  Stock
0   ball     10     50
1   doll     20     30
2    car     15     40
3  block      5    100

In [43]:
df.head(2) # first 2 data

    Toy  Price  Stock
0  ball     10     50
1  doll     20     30

In [44]:
df.tail(2) # Last 2 data

     Toy  Price  Stock
2    car     15     40
3  block      5    100

# Loading a CSV file in pandas

In [45]:
df = pd.read_csv('toys.csv')
df = pd.read_xlsx('toys.xlsx')
df = pd.read_json('toys.json')
df = pd.read_txt('toys.txt')

FileNotFoundError: [Errno 2] No such file or directory: 'toys.csv'

In [ ]:
df.to_csv('my_toys.csv', index=False) # save csv files

In [ ]:
df = pd.read_csv('my_toys.csv') # load our saved csv file

In [ ]:
df.head(3) # top 3

    Toy  Price  Stock
0  ball     10     50
1  doll     20     30
2   car     15     40

In [46]:
df.tail(3) # last 3

     Toy  Price  Stock
1   doll     20     30
2    car     15     40
3  block      5    100

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Toy     4 non-null      object
 1   Price   4 non-null      int64
 2   Stock   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [48]:
df.dtypes

Toy      object
Price     int64
Stock     int64
dtype: object

In [49]:
df.describe()

           Price       Stock
count   4.000000    4.000000
mean   12.500000   55.000000
std     6.454972   31.091264
min     5.000000   30.000000
25%     8.750000   37.500000
50%    12.500000   45.000000
75%    16.250000   62.500000
max    20.000000  100.000000

In [50]:
df.shape

(4, 3)

In [51]:
df.size

12

In [52]:
df.columns

Index(['Toy', 'Price', 'Stock'], dtype='object')

In [53]:
df.describe(include = 'all')

         Toy      Price       Stock
count      4   4.000000    4.000000
unique     4        NaN         NaN
top     ball        NaN         NaN
freq       1        NaN         NaN
mean     NaN  12.500000   55.000000
std      NaN   6.454972   31.091264
min      NaN   5.000000   30.000000
25%      NaN   8.750000   37.500000
50%      NaN  12.500000   45.000000
75%      NaN  16.250000   62.500000
max      NaN  20.000000  100.000000

In [54]:
df1 = df.copy() # copy dataframe

In [55]:
df1.columns # check columns

Index(['Toy', 'Price', 'Stock'], dtype='object')

In [56]:
df.columns

Index(['Toy', 'Price', 'Stock'], dtype='object')

In [57]:
df1.columns = ['Item', 'Cost', 'Quantity'] # change column names

In [58]:
df1.columns

Index(['Item', 'Cost', 'Quantity'], dtype='object')

In [59]:
df.head()

     Toy  Price  Stock
0   ball     10     50
1   doll     20     30
2    car     15     40
3  block      5    100

In [60]:
df1.head()

    Item  Cost  Quantity
0   ball    10        50
1   doll    20        30
2    car    15        40
3  block     5       100

# Selecting or Slicing of Data

In [61]:
df['Toy']

0     ball
1     doll
2      car
3    block
Name: Toy, dtype: object

In [62]:
df[['Toy', 'Price']]

     Toy  Price
0   ball     10
1   doll     20
2    car     15
3  block      5

In [63]:
df.head()

     Toy  Price  Stock
0   ball     10     50
1   doll     20     30
2    car     15     40
3  block      5    100

In [ ]:
df.loc[3] # Gives the values for the fourth row of each column

Toy      block
Price        5
Stock      100
Name: 3, dtype: object

In [71]:
df.iloc[3]

Toy      block
Price        5
Stock      100
Name: 3, dtype: object

In [66]:
df.head()

     Toy  Price  Stock
0   ball     10     50
1   doll     20     30
2    car     15     40
3  block      5    100

In [ ]:
df.iloc[0] # gets the first row for all the columns

Toy      ball
Price      10
Stock      50
Name: 0, dtype: object

In [72]:
df.loc[0]

Toy      ball
Price      10
Stock      50
Name: 0, dtype: object

In [68]:
df.head()

     Toy  Price  Stock
0   ball     10     50
1   doll     20     30
2    car     15     40
3  block      5    100

In [ ]:
df.loc[1:3, 'Toy'] # gets from the second to fourth row of the column 'Toy'

1     doll
2      car
3    block
Name: Toy, dtype: object

In [73]:
df.iloc[1:3, 'Toy']

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [70]:
df.head()

     Toy  Price  Stock
0   ball     10     50
1   doll     20     30
2    car     15     40
3  block      5    100

In [ ]:
df.iloc[:, 0] # Gives us everything in the first column

0     ball
1     doll
2      car
3    block
Name: Toy, dtype: object

In [74]:
df.loc[:, 0]

KeyError: 0

In [78]:
df.head()

     Toy  Price  Stock
0   ball     10     50
1   doll     20     30
2    car     15     40
3  block      5    100

In [76]:
df.iloc[1, 0]

'doll'

In [77]:
df.loc[1, 0]

KeyError: 0

In [82]:
# Creating a pandas data frame
import pandas as pd
df = pd.DataFrame({
    'Toy': ['ball', 'doll', 'car', 'block', 'NaN'],
    'Price': [10, 20, 15, 5, 25],
    'Stock': [50, 30, 40, 100, 70]
})
print(df)

     Toy  Price  Stock
0   ball     10     50
1   doll     20     30
2    car     15     40
3  block      5    100
4    NaN     25     70

In [83]:
df.isnull().sum()

Toy      0
Price    0
Stock    0
dtype: int64

In [85]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, np.nan, 30, 22, np.nan],
    'City': ['London', 'Manchester', np.nan, 'Bristol', 'Liverpool'],
    'Salary': [50000, 48000, np.nan, 52000, 47000],
    'Department': ['HR', np.nan, 'IT', 'Finance', 'HR']
}

df = pd.DataFrame(data)
print(df)

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      NaN         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [86]:
df.head()

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      NaN         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [87]:
df.isnull().sum()

Name          0
Age           2
City          1
Salary        1
Department    1
dtype: int64

In [88]:
df.isna().sum()

Name          0
Age           2
City          1
Salary        1
Department    1
dtype: int64

In [89]:
df.head()

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      NaN         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [90]:
df1 = df.copy()

In [92]:
df2 = df1.copy()

In [91]:
df1.head()

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      NaN         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [93]:
df2.head()

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      NaN         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [ ]:
df1['Salary'] = df1['Salary'].fillna(0) # fills null values in the selected column with zero
df1.head()

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      0.0         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [103]:
df1.isna().sum()

Name          0
Age           2
City          1
Salary        0
Department    1
dtype: int64

In [102]:
df2.head()

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      NaN         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [ ]:
df = df.dropna() # drops all null values

In [108]:
df.isnull().sum()

Name          0
Age           0
City          0
Salary        0
Department    0
dtype: int64

In [109]:
df.head()

    Name   Age     City   Salary Department
0  Alice  25.0   London  50000.0         HR
3  David  22.0  Bristol  52000.0    Finance

In [110]:
df2.head()

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      NaN         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [111]:
df3 = df2.copy()

In [112]:
df4 = df2.copy()

In [113]:
df2.head()

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      NaN         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [114]:
df2['Salary'].fillna(0) # fills null values in the selected column with zero

0    50000.0
1    48000.0
2        0.0
3    52000.0
4    47000.0
Name: Salary, dtype: float64

In [115]:
df2.head()

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      NaN         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [116]:
df2.isna().sum()

Name          0
Age           2
City          1
Salary        1
Department    1
dtype: int64

In [117]:
df2['Salary'] = df2['Salary'].fillna(0) # fills null values in the selected column with zero

In [119]:
df2.isna().sum()

Name          0
Age           2
City          1
Salary        0
Department    1
dtype: int64

In [118]:
df2.head()

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      0.0         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [120]:
df3.head()

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      NaN         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [121]:
df3.isna().sum()

Name          0
Age           2
City          1
Salary        1
Department    1
dtype: int64

In [122]:
df3.dropna() # drops all null values

    Name   Age     City   Salary Department
0  Alice  25.0   London  50000.0         HR
3  David  22.0  Bristol  52000.0    Finance

In [123]:
df3.head()

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      NaN         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [124]:
df3.isna().sum()

Name          0
Age           2
City          1
Salary        1
Department    1
dtype: int64

In [125]:
df3 = df3.dropna() # drops all null values

In [126]:
df3.head()

    Name   Age     City   Salary Department
0  Alice  25.0   London  50000.0         HR
3  David  22.0  Bristol  52000.0    Finance

In [127]:
df3.isna().sum()

Name          0
Age           0
City          0
Salary        0
Department    0
dtype: int64

In [129]:
df5 = df4.copy()

In [130]:
df6 = df4.copy()

In [128]:
df4.head()

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      NaN         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [131]:
df4.dtypes

Name           object
Age           float64
City           object
Salary        float64
Department     object
dtype: object

In [132]:
df4['Salary'] = df4['Salary'].fillna(0)

In [133]:
df4.head()

      Name   Age        City   Salary Department
0    Alice  25.0      London  50000.0         HR
1      Bob   NaN  Manchester  48000.0        NaN
2  Charlie  30.0         NaN      0.0         IT
3    David  22.0     Bristol  52000.0    Finance
4      Eve   NaN   Liverpool  47000.0         HR

In [134]:
df4.dtypes

Name           object
Age           float64
City           object
Salary        float64
Department     object
dtype: object

In [135]:
df4['Salary'] = df4['Salary'].astype(int)

In [136]:
df4.dtypes

Name           object
Age           float64
City           object
Salary          int64
Department     object
dtype: object

In [137]:
df4.head()

      Name   Age        City  Salary Department
0    Alice  25.0      London   50000         HR
1      Bob   NaN  Manchester   48000        NaN
2  Charlie  30.0         NaN       0         IT
3    David  22.0     Bristol   52000    Finance
4      Eve   NaN   Liverpool   47000         HR

In [138]:
df4['Age'] = df4['Age'].fillna(0)

In [139]:
df4['Age'] = df4['Age'].astype(int)

In [140]:
df4.dtypes

Name          object
Age            int64
City          object
Salary         int64
Department    object
dtype: object

In [141]:
df4.head()

      Name  Age        City  Salary Department
0    Alice   25      London   50000         HR
1      Bob    0  Manchester   48000        NaN
2  Charlie   30         NaN       0         IT
3    David   22     Bristol   52000    Finance
4      Eve    0   Liverpool   47000         HR